extends Node


var map :Dictionary= { 
	"一萬" : Rect2(0,0,116,160),
	"二萬" : Rect2(147,0,116,160),
	"三萬" : Rect2(294,0,116,160),
	"四萬" : Rect2(441,0,116,160),
	"五萬" : Rect2(588,0,116,160),
	"六萬" : Rect2(735,0,116,160),
	"七萬" : Rect2(882,0,116,160),
	"八萬" : Rect2(1029,0,116,160),
	"九萬" : Rect2(1176,0,116,160),
	"一筒" : Rect2(0,188,116,160),
	"二筒" : Rect2(147,188,116,160),
	"三筒" : Rect2(294,188,116,160),
	"四筒" : Rect2(441,188,116,160),
	"五筒" : Rect2(588,188,116,160),
	"六筒" : Rect2(735,188,116,160),
	"七筒" : Rect2(882,188,116,160),
	"八筒" : Rect2(1029,188,116,160),
	"九筒" : Rect2(1176,188,116,160),
	"一條" : Rect2(0,376,116,160),
	"二條" : Rect2(147,376,116,160),
	"三條" : Rect2(294,376,116,160),
	"四條" : Rect2(441,376,116,160),
	"五條" : Rect2(588,376,116,160),
	"六條" : Rect2(735,376,116,160),
	"七條" : Rect2(882,376,116,160),
	"八條" : Rect2(1029,376,116,160),
	"九條" : Rect2(1176,376,116,160),
	"東": Rect2(0,564,116,160), 
	"南": Rect2(147,564,116,160), 
	"西": Rect2(294,564,116,160), 
	"北": Rect2(441,564,116,160),
	"發": Rect2(588,564,116,160), 
	"中": Rect2(735,564,116,160), 
	"白": Rect2(0,752,116,160),
	"反面" : Rect2(147,752,116,160)
	}
	
var mahjong_tiles:Array = [
	"一萬", "二萬", "三萬", "四萬", "五萬", "六萬", "七萬", "八萬", "九萬",
	"一筒", "二筒", "三筒", "四筒", "五筒", "六筒", "七筒", "八筒", "九筒",
	"一條", "二條", "三條", "四條", "五條", "六條", "七條", "八條", "九條",
	"東", "南", "西", "北",
	"發", "中", "白"]

var sort_mahjong_tiles : Dictionary = {
	"一萬": 0,
	"二萬": 1,
	"三萬": 2,
	"四萬": 3,
	"五萬": 4,
	"六萬": 5,
	"七萬": 6,
	"八萬": 7,
	"九萬": 8,
	"一筒": 9,
	"二筒": 10,
	"三筒": 11,
	"四筒": 12,
	"五筒": 13,
	"六筒": 14,
	"七筒": 15,
	"八筒": 16,
	"九筒": 17,
	"一條": 18,
	"二條": 19,
	"三條": 20,
	"四條": 21,
	"五條": 22,
	"六條": 23,
	"七條": 24,
	"八條": 25,
	"九條": 26,
	"東": 27,
	"南": 28,
	"西": 29,
	"北": 30,
	"發": 31,
	"中": 32,
	"白": 33
}

# "system"
# "main"
# "env"
# "short"
# "goal"
# "plan"
# "reflect"

var question : Dictionary = {
	"Discard_a_tile" : ["請根據計畫的內容，打出一張手牌，精簡回答要打出的手牌。" ,["system","env","plan"]],
	#"Generate_plan" : ["請根據目標的內容，生成一個以目標記憶體為方向的計畫。ex.目標:...計畫:...  。以上為例子，以下為回答規則，回答時避免類似的答案，以及回答盡可能精簡,且計畫只需針對目標即可。",["system","main","env","short","reflect"]],
	"Generate_plan" :["針對目標,生成一個自己的計畫，思考利用手牌組牌，輸出要從手牌丟棄的一張牌",["system","main","env","short","goal","reflect"]],
	"Check_plan" : ["針對目標,生成一個自己的計畫思考利用手牌組牌，輸出要從手牌丟棄的一張牌",["system","main","env","short","goal","reflect"]],
	"Generate_reflection" : ["請根據這把的內容，檢討這一把的問題在何處，整理成反思。",["system","main","env","short","plan","reflect"]],
	"event_choice" : ["請根據選擇的內容，回答是否要做出選擇，你所有可以回答的選項有[槓、碰、吃、放棄]且請回答字即可，請根據接下來會提供可以做為選擇作為選項,",["system","main","env","short","plan","reflect"]],
	"eat_choice" : ["請根據選擇的內容，回答是否要做出選擇，你所有可以回答的選項有[A、B、C]且請回答字即可，請根據接下來會提供可以做為選擇作為選項,",["system","main","env","short","plan","reflect"]],
	"error_response" : ["你回答的內容有誤，請重新回答。",["system","main","env","short","plan","reflect"]]
	
} 
